#+title: CTRE CLI Tools

** Releases

#+begin_src shell
wget -O- https://redist.ctr-electronics.com/index.json | jq . > redist.json
#+end_src

#+RESULTS:

=.Tools[] | [.Name, (.Items | group_by(.Compliancy)) | ... )]= ... hmm. not
=HAVING= a good time selecting that.

#+name: ctre-tools-jq
#+headers: :stdin ctre-tools-info
#+begin_src jq :cmd-line -rj
.Tools[]
  | [
      .Name,
      (.Items
      | sort_by(.Compliancy)
      | last
      | [["linuxx86-64", .Version, .Urls."linuxx86-64", .Urls."linuxx86-64-sha1"], ["linuxarm64", .Version, .Urls."linuxarm64", .Urls."linuxarm64-sha1"]])
    ]
| first as $name
| nth(2) as $version
| reduce last[] as $arch ([]; . + [[$name,$arch]])
| map(flatten)
# | map(@csv) | join("\n")
#+end_src

#+name: ctre-tools-pkgbuild-metadata
#+headers: :results output
#+begin_src jq :stdin ctre-tools-jq :var tool="owlet" arch="linuxarm64" :cmd-line "--raw-output" 
map(select(first == $tool and nth(1) == $arch))
  | flatten | select(length > 0)
  | "sources_\( $arch )=\"\( .[3] )\"\nsha1sums_\( $arch )=\"\( .[4] )\""
#+end_src

#+RESULTS: ctre-tools-pkgbuild-metadata
: sources_linuxarm64="https://redist.ctr-electronics.com/tools/owlet/25.90.2/owlet-25.90.2-linuxarm64"
: sha1sums_linuxarm64="b9f454eeaf4cbc7c32382b4bf4e6b491bbe3d3ad"

#+name: ctre-tools-info
#+headers: :jq-args "--raw-output" :eval query :results output value
#+begin_src restclient :jq .
:ctre-url = https://redist.ctr-electronics.com/index.json

:headers = <<
Accept: application/json
User-Agent: Emacs
#

GET :ctre-url
:headers
#+end_src

........ and compliancy doesn't do what i think it does

# :stdin ctre-tools-info
#+name: ctre-tools-windows
#+headers: :in-file redist.json :cmd-line "-rj"
#+begin_src jq
.Tools[]
  | {(.Name): (
         .Items | last | [
           .Version,
           "linuxx86-64",
           .Urls."linuxx86-64",
           .Urls."linuxx86-64-sha1",
           "linuxarm64",
           .Urls."linuxarm64",
           .Urls."linuxarm64-sha1"])
    }
#+end_src

#+RESULTS: ctre-tools-windows

#+name: ctre-tools-pkgbuild-metadata2
#+headers: :results output
#+begin_src jq :stdin ctre-tools-windows :var tool="owlet" arch="aarch64" :cmd-line "-rj" 
."\($tool)" | select(.)
  | if ($arch == "x86_64") then
      "source_x86_64=(\"\( .[2] )\")
sha1sums_x86_64=(\"\( .[3] )\")"
    else
      "source_aarch64=(\"\( .[5] )\")
sha1sums_aarch64=(\"\( .[6] )\")"
    end
#+end_src

#+RESULTS: ctre-tools-pkgbuild-metadata2
: "sources_aarch64=(\"https://redist.ctr-electronics.com/tools/owlet/26.1.0/owlet-26.1.0-linuxarm64\")\nsha1sums_aarch64=(\"ddc2d5fa2bf3982ecffa6fcb07cb3668f5562eed\")"

#+name: ctre-tools-pkgbuild-version
#+headers: :results output
#+begin_src jq :stdin ctre-tools-windows :var tool="owlet" :cmd-line "-rj" 
."\($tool)" | select(.)
  | "pkgver=\"\( .[0] )\""
#+end_src

#+RESULTS: ctre-tools-pkgbuild-version
: version="26.1.0"

